persian_event/test/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.generic.adapter.integration.components.ams.products.ptinovacao.pt/"> <soapenv:Header> <ser:adapterHeader> <system>NGIN</system> <operation>Subscricao</operation> <externalId>1610051932</externalId> <username>nginUser</username> <passwd>XDF$%%#$@##</passwd> </ser:adapterHeader> </soapenv:Header> <soapenv:Body> <ser:processEvent> <adapterInfo> <adapterId>1</adapterId> <name>Adaptador de Subscricao</name> <eventTime>2016-10-05 15:00:00</eventTime> <eventBaseTime>2016-10-05 15:00:00</eventBaseTime> <ser:simpleItem> <id>001001</id> <value>1610052141</value> <name>ACCOUNT</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>004002</id> <value>30</value> <name>RECHARGE_VALUE</name> <type>Double</type> </ser:simpleItem> <ser:simpleItem> <id>001006</id> <value>11</value> <name>AREA_CODE</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>001002</id> <value>7</value> <name>CLIENT_TYPE</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>001011</id> <value>AGSA11060000</value> <name>EQUIPMENT_MODEL</name> <type>String</type> </ser:simpleItem> <ser:simpleItem> <id>001013</id> <value>2012-04-13 17:34:45</value> <name>FIRST_USE</name> <type>Date</type> </ser:simpleItem> <ser:simpleItem> <id>001022</id> <value>2015-08-25 17:34:45</value> <name>PROFILE_DATE</name> <type>Date</type> </ser:simpleItem> <ser:simpleItem> <id>001023</id> <value>1</value> <name>PRODUCT_TYPE</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>001024</id> <value>2015-10-11 17:34:45</value> <name>PROVISION_DATE</name> <type>Date</type> </ser:simpleItem> <!--<ser:simpleItem> <id>001025</id> <value>2015-10-11 17:34:45</value> <name>CURRENT_BILLING_CYCLE_DATE</name> <type>Date</type> </ser:simpleItem>--> <ser:simpleItem> <id>001008</id> <value>SP</value> <name>GEOGRAPHICAL_STATE</name> <type>String</type> </ser:simpleItem> <ser:simpleItem> <id>001014</id> <value>2013-07-18 16:10:21</value> <name>LAST_RECHARGE</name> <type>Date</type> </ser:simpleItem> <ser:simpleItem> <id>001015</id> <value>26</value> <name>LAST_RECHARGE_VALUE</name> <type>Double</type> </ser:simpleItem> <ser:simpleItem> <id>001016</id> <value>2012-04-13 17:34:43</value> <name>LAST_RENEW_CYCLE</name> <type>Date</type> </ser:simpleItem> <ser:simpleItem> <id>001017</id> <value>80</value> <name>LAST_RENEW_CYCLE_VALUE</name> <type>Double</type> </ser:simpleItem> <ser:simpleItem> <id>001012</id> <value>3</value> <name>MANUFACTURER</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>001003</id> <value>11995054825</value> <name>MSISDN</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>002019</id> <value>0</value> <name>PORTABILITY_SITUATION_CODE</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>001004</id> <value>VIVOTODAGSM</value> <name>PROFILE</name> <type>String</type> </ser:simpleItem> <ser:simpleItem> <id>001009</id> <value>30</value> <name>STATE</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>001010</id> <value>2012-04-13 17:34:45</value> <name>STATE_DATE</name> <type>Date</type> </ser:simpleItem> <ser:simpleItem> <id>001005</id> <value>GSM</value> <name>TECHNOLOGY</name> <type>String</type> </ser:simpleItem> <ser:simpleItem> <id>001007</id> <value>2</value> <name>TELCO</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>003001</id> <value>2012-05-18 16:12:06</value> <name>EVENT_REC_DATE</name> <type>Date</type> </ser:simpleItem> <ser:simpleItem> <id>003002</id> <value>2012-05-18 16:12:07</value> <name>EVENT_PROC_DATE</name> <type>Date</type> </ser:simpleItem> <ser:simpleItem> <id>003003</id> <value>1</value> <name>REASON_CODE</name> <type>Long</type> </ser:simpleItem> <ser:listItem> <id>002001</id> <value>PROMO_LIST</value> <name>PROMO_LIST</name> <type>String</type> <ser:listItem> <id>002002</id> <value>870</value> <name>PROMOTION</name> <type>Long</type> <ser:simpleItem> <id>002003</id> <value>870</value> <name>PROMO_CODE</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>002004</id> <value>1</value> <name>INSTANCE_NBR</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>002005</id> <value>2</value> <name>SUB_STATUS</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>002006</id> <value>2015-11-02 00:00:00</value> <name>SUB_STATUS_DATE</name> <type>Date</type> </ser:simpleItem> <ser:simpleItem> <id>002007</id> <value>157</value> <name>SUB_STATUS_REASON</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>002008</id> <value>230</value> <name>SUB_STATUS_EVENT</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>002009</id> <value>2065-11-02 23:59:59</value> <name>SUB_STATUS_REVAL_DATE</name> <type>Date</type> </ser:simpleItem> </ser:listItem> </ser:listItem> <ser:listItem> <id>002010</id> <value>PRODUCT_LIST</value> <name>PRODUCT_LIST</name> <type>String</type> <ser:listItem> <id>002011</id> <value>VIVOAVISATASTE</value> <name>PRODUCT</name> <type>String</type> <ser:simpleItem> <id>002012</id> <value>VIVOAVISATASTE</value> <name>SERVICE</name> <type>String</type> </ser:simpleItem> <ser:simpleItem> <id>002013</id> <value>ACT</value> <name>SERVICE_STATE</name> <type>String</type> </ser:simpleItem> <ser:simpleItem> <id>002014</id> <value>2012-08-16 23:59:59</value> <name>EXPIRATION_DATE</name> <type>Date</type> </ser:simpleItem> </ser:listItem> <ser:listItem> <id>002011</id> <value>PACK_PJB300_MSL</value> <name>PRODUCT</name> <type>String</type> <ser:simpleItem> <id>002012</id> <value>PACK_PJB300_MSL</value> <name>SERVICE</name> <type>String</type> </ser:simpleItem> <ser:simpleItem> <id>002013</id> <value>ACT</value> <name>SERVICE_STATE</name> <type>String</type> </ser:simpleItem> <ser:simpleItem> <id>002014</id> <value>2014-04-13 23:59:59</value> <name>EXPIRATION_DATE</name> <type>Date</type> </ser:simpleItem> </ser:listItem> </ser:listItem> <ser:listItem> <id>002015</id> <value>TAG_LIST</value> <name>TAG_LIST</name> <type>String</type> </ser:listItem> <ser:simpleItem> <id>004005</id> <value>3</value> <name>CHANNEL_CODE</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>004006</id> <value>000</value> <name>MEDIA_CODE</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>004001</id> <value>239</value> <name>MIX_CODE</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>003005</id> <value>19</value> <name>MULTI_OPERATION</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>004003</id> <value>2</value> <name>RECHARGE_TYPE</name> <type>Long</type> </ser:simpleItem> <ser:simpleItem> <id>004007</id> <value>3</value> <name>SUBCHANNEL_CODE</name> <type>String</type> </ser:simpleItem> <ser:listItem> <id>005001</id> <value>campaigns</value> <name>CAMPAIGNS</name> <type>String</type> </ser:listItem> <ser:listItem> <id>001016</id> <value>00000002</value> <name>NOTIF_PERMISSIONS</name> <type>String</type> </ser:listItem> </adapterInfo> </ser:processEvent> </soapenv:Body> </soapenv:Envelope>
